import LineChart from "../chart/LineChart/LineChart";

function LicenseIssuanceTimeline() {
  const data = [
    {
      Year: "فروردین1397",
      "روند ماهانه صدور مجوز": 50000,
      "روند تجمعی صدور مجوز سالانه": 500000,
    },
    {
      Year: "مرداد1397",
      "روند ماهانه صدور مجوز": 140000,
      "روند تجمعی صدور مجوز سالانه": 570000,
    },
    {
      Year: "آذر1397",
      "روند ماهانه صدور مجوز": 250000,
      "روند تجمعی صدور مجوز سالانه": 1000000,
    },

    {
      Year: "فروردین1398",
      "روند ماهانه صدور مجوز": 45000,
      "روند تجمعی صدور مجوز سالانه": 1100000,
    },
    {
      Year: "مرداد1398",
      "روند ماهانه صدور مجوز": 60000,
      "روند تجمعی صدور مجوز سالانه": 1150000,
    },
    {
      Year: "آذر1398",
      "روند ماهانه صدور مجوز": 90000,
      "روند تجمعی صدور مجوز سالانه": 1200000,
    },

    {
      Year: "فروردین1399",
      "روند ماهانه صدور مجوز": 75000,
      "روند تجمعی صدور مجوز سالانه": 1500000,
    },
    {
      Year: "مرداد1399",
      "روند ماهانه صدور مجوز": 100000,
      "روند تجمعی صدور مجوز سالانه": 1750000,
    },
    {
      Year: "آذر1399",
      "روند ماهانه صدور مجوز": 110000,
      "روند تجمعی صدور مجوز سالانه": 1800000,
    },

    {
      Year: "فروردین1400",
      "روند ماهانه صدور مجوز": 120000,
      "روند تجمعی صدور مجوز سالانه": 1900000,
    },
    {
      Year: "مرداد1400",
      "روند ماهانه صدور مجوز": 130000,
      "روند تجمعی صدور مجوز سالانه": 2000000,
    },
    {
      Year: "آذر1400",
      "روند ماهانه صدور مجوز": 140000,
      "روند تجمعی صدور مجوز سالانه": 2000000,
    },

    {
      Year: "فروردین1401",
      "روند ماهانه صدور مجوز": 150000,
      "روند تجمعی صدور مجوز سالانه": 2500000,
    },
    {
      Year: "مرداد1401",
      "روند ماهانه صدور مجوز": 160000,
      "روند تجمعی صدور مجوز سالانه": 2800000,
    },
    {
      Year: "آذر1401",
      "روند ماهانه صدور مجوز": 170000,
      "روند تجمعی صدور مجوز سالانه": 3000000,
    },

    {
      Year: "فروردین1402",
      "روند ماهانه صدور مجوز": 180000,
      "روند تجمعی صدور مجوز سالانه": 3500000,
    },
    {
      Year: "مرداد1402",
      "روند ماهانه صدور مجوز": 190000,
      "روند تجمعی صدور مجوز سالانه": 4000000,
    },
    {
      Year: "آذر1402",
      "روند ماهانه صدور مجوز": 200000,
      "روند تجمعی صدور مجوز سالانه": 4800000,
    },

    {
      Year: "فروردین1403",
      "روند ماهانه صدور مجوز": 210000,
      "روند تجمعی صدور مجوز سالانه": 5000000,
    },
    {
      Year: "مرداد1403",
      "روند ماهانه صدور مجوز": 220000,
      "روند تجمعی صدور مجوز سالانه": 5500000,
    },
    {
      Year: "آذر1403",
      "روند ماهانه صدور مجوز": 230000,
      "روند تجمعی صدور مجوز سالانه": 6000000,
    },

    {
      Year: "فروردین1404",
      "روند ماهانه صدور مجوز": 240000,
      "روند تجمعی صدور مجوز سالانه": 6500000,
    },
    {
      Year: "مرداد1404",
      "روند ماهانه صدور مجوز": 250000,
      "روند تجمعی صدور مجوز سالانه": 7500000,
    },
    {
      Year: "آذر1404",
      "روند ماهانه صدور مجوز": 260000,
      "روند تجمعی صدور مجوز سالانه": 8000000,
    },
  ];

  return (
    <div className="bg-white rounded-2xl mt-4">
      <LineChart data={data} title="پراکندگی زمانی صدور مجوز" />
    </div>
  );
}

export default LicenseIssuanceTimeline;
